/* 
   Localizable.strings
   Granulay
   
   Portuguese (Brazil) localization
*/

// App Info
"app.name" = "Granulay";
"app.beta" = "BETA";

// Menu Bar
"menu.enable_effect" = "Ativar Efeito";
"menu.disable_effect" = "Desativar Efeito";
"menu.lofi_station" = "Estação Lo-Fi";
"menu.settings" = "Configurações...";

"menu.quit" = "Sair";

// Settings - General
"settings.window_title" = "Configurações do Granulay";
"settings.title" = "Configurações";
"settings.enable_effect" = "Ativar Efeito";
"settings.intensity" = "Intensidade";
"settings.intensity.weak" = "Fraco";
"settings.intensity.medium" = "Médio";
"settings.intensity.strong" = "Forte";
"settings.grain_style" = "Estilo do Grão";
"settings.grain_style.fine" = "Fino";
"settings.grain_style.medium" = "Médio";
"settings.grain_style.coarse" = "Grosso";
"settings.grain_style.vintage" = "Vintage";
"settings.preserve_brightness" = "Preservar Brilho";
"settings.preserve_brightness.description" = "Mantém o brilho original da tela";

// Settings - Advanced
"settings.advanced" = "Avançado";
"settings.save_automatically" = "Salvar Configurações Automaticamente";
"settings.save_automatically.description" = "As alterações são salvas instantaneamente";
"settings.show_in_dock" = "Mostrar no Dock";
"settings.show_in_dock.description" = "Exibe o ícone do app no Dock";



// Settings - Categories
"settings.category.appearance" = "Aparência";
"settings.category.behavior" = "Comportamento";
"settings.category.lofi" = "Estação Lo-Fi";

"settings.category.support" = "Suporte";
"settings.category.purchase" = "Versão Completa";

// Settings - Section Titles and Descriptions
"settings.appearance.title" = "Efeito Granulay";
"settings.appearance.description" = "Configure a aparência do efeito na tela.";
"settings.behavior.title" = "Comportamento";
"settings.behavior.description" = "Configure como o app se comporta no sistema.";
"settings.behavior.reset_title" = "Redefinir Configurações";
"settings.behavior.reset_description" = "Restaura todas as configurações para os valores padrão.";

"settings.lofi.title" = "Estação Lo-Fi";
"settings.lofi.description" = "Controle sua música lo-fi ambiente para maior concentração.";
"settings.support.title" = "Suporte";
"settings.support.description" = "Envie feedback ou reporte problemas.";

// Settings - Feedback
"settings.feedback" = "Feedback";
"settings.feedback.placeholder" = "Compartilhe sua experiência, reporte bugs ou sugira melhorias...";
"settings.feedback.send" = "Enviar Feedback";
"settings.feedback.sent" = "Feedback enviado com sucesso!";
"settings.feedback.error" = "Erro ao enviar feedback. Tente novamente.";
"settings.feedback.validation" = "Por favor, digite uma mensagem antes de enviar.";

// Settings - Actions
"settings.reset" = "Restaurar Padrões";
"settings.reset.description" = "Volta às configurações originais";
"settings.export" = "Exportar Configurações";
"settings.export.description" = "Salva suas configurações em um arquivo";
"settings.import" = "Importar Configurações";
"settings.import.description" = "Carrega configurações de um arquivo";

// Loading and Status
"loading.applying_changes" = "Aplicando alterações...";

"loading.sending_feedback" = "Enviando feedback...";
"loading.resetting" = "Restaurando configurações...";
"loading.exporting" = "Exportando configurações...";
"loading.importing" = "Importando configurações...";

// Alerts and Messages
"alert.reset.title" = "Restaurar Configurações";
"alert.reset.message" = "Tem certeza que deseja restaurar todas as configurações para os valores padrão?";
"alert.reset.confirm" = "Restaurar";
"alert.reset.cancel" = "Cancelar";
"alert.export.success" = "Configurações exportadas com sucesso!";
"alert.import.success" = "Configurações importadas com sucesso!";
"alert.import.error" = "Erro ao importar configurações. Verifique se o arquivo é válido.";

// Lo-Fi Music
"lofi.title" = "Estação Lo-Fi";
"lofi.playing" = "Tocando";
"lofi.stopped" = "Parado";
"lofi.volume" = "Volume";
"lofi.station" = "Estação";
"lofi.play" = "Tocar";
"lofi.pause" = "Pausar";
"lofi.stop" = "Parar";
"lofi.previous_station" = "Estação Anterior";
"lofi.next_station" = "Próxima Estação";
"lofi.next" = "Próxima";
"lofi.previous" = "Anterior";
"lofi.previous_track" = "Faixa Anterior";
"lofi.next_track" = "Próxima Faixa";
"lofi.current_track" = "Faixa: %@";
"lofi.shuffle" = "Aleatório";
"lofi.repeat" = "Repetir";
"lofi.loading" = "Carregando...";
"lofi.credits" = "Todas as faixas são royalty-free do Pixabay.com";
"lofi.credits.button" = "Créditos Pixabay";
"lofi.credits.format" = "Music by %@ from Pixabay (ID: %@)";

// Purchase Settings
"purchase.trial.title" = "Versão Trial";
"purchase.trial.description" = "Você está usando a versão trial do Granulay com funcionalidades limitadas:";
"purchase.trial.basic_grain" = "Efeito de grão básico (estilo Fine, intensidade Fraca)";
"purchase.trial.all_grain_styles" = "Todos os estilos e intensidades de grão";
"purchase.trial.lofi_functionality" = "Funcionalidade Lo-Fi";
"purchase.trial.behavior_settings" = "Configurações de comportamento";
"purchase.trial.preserve_brightness" = "Preservar brilho";
"purchase.unlock.title" = "Desbloqueie todas as funcionalidades:";
"purchase.unlock.all_grain_styles" = "Todos os estilos de grão (Fine, Medium, Coarse)";
"purchase.unlock.all_intensities" = "Todas as intensidades (Fraca, Média, Forte)";
"purchase.unlock.complete_lofi" = "Funcionalidade Lo-Fi completa";
"purchase.unlock.advanced_settings" = "Configurações avançadas de comportamento";
"purchase.unlock.preserve_brightness" = "Opção de preservar brilho";
"purchase.button.title" = "Comprar Versão Completa";
"purchase.lifetime_access" = "💎 Acesso completo e vitalício";
"purchase.error.title" = "Erro";
"purchase.error.message" = "Não foi possível abrir a loja. Tente novamente mais tarde.";
"purchase.error.ok" = "OK";

/* Lo-Fi Status Messages */
"lofi.status.ready" = "Pronto para reproduzir";
"lofi.status.failed" = "Falhou";
"lofi.status.unknown" = "Desconhecido";
"lofi.status.other" = "Outro";

/* Lo-Fi Error Messages */
"lofi.error.playback" = "Erro de reprodução";
"lofi.error.code" = "Código do erro";
"lofi.error.network" = "Erro de rede detectado, tentando novamente...";
"lofi.error.unrecoverable" = "Erro não recuperável, pulando para próxima faixa";
"lofi.error.max_retries" = "Máximo de tentativas atingido, pulando faixa";
"lofi.error.no_network" = "Sem conexão de rede disponível para retry";

/* Lo-Fi Success Messages */
"lofi.success.track_completed" = "Faixa concluída naturalmente";
"lofi.success.playback_started" = "Reprodução iniciada";
"lofi.success.preparing" = "Preparando reprodução";

/* Lo-Fi Retry Messages */
"lofi.retry.attempt" = "Tentativa %d/%d";
"lofi.retry.not_ready" = "Item não está pronto, tentando mesmo assim...";

// File Operations
"file.export.title" = "Exportar Configurações";
"file.import.title" = "Importar Configurações";
"file.settings.extension" = "granulay";

// Trial Version
"trial.title" = "Granulay Trial";
"trial.subtitle" = "Experimente o efeito granulado vintage";
"trial.limitations.title" = "Limitações da Versão Trial";
"trial.limitations.grain_style" = "• Estilo de grão limitado apenas ao Fino";
"trial.limitations.intensity" = "• Intensidade de grão limitada apenas ao Fraco";
"trial.limitations.brightness" = "• Preservar brilho desativado";
"trial.limitations.lofi" = "• Estação Lo-Fi não disponível";
"trial.limitations.behavior" = "• Configurações de comportamento não disponíveis";
"trial.full_version.title" = "Recursos da Versão Completa";
"trial.full_version.all_styles" = "• Todos os estilos de grão (Fino, Médio, Grosso, Vintage)";
"trial.full_version.all_intensities" = "• Todos os níveis de intensidade (Fraco, Médio, Forte)";
"trial.full_version.brightness" = "• Opção de preservar brilho";
"trial.full_version.lofi" = "• Estação Lo-Fi completa com múltiplas estações";
"trial.full_version.behavior" = "• Personalização completa de comportamento";
"trial.full_version.updates" = "• Atualizações automáticas";
"trial.purchase.button" = "Obter Versão Completa";

// Performance Quality
"performance.quality.excellent" = "Excelente";
"performance.quality.good" = "Boa";
"performance.quality.medium" = "Média";
"performance.quality.low" = "Baixa";
"trial.purchase.description" = "Desbloqueie todos os recursos e apoie o desenvolvimento";
